---
kind: other
id: Methods.T:Autodesk.Revit.DB.NurbsSurfaceData
source: html/91378612-4fb8-12a4-04ef-76dc9b573dd9.htm
---
# NurbsSurfaceData Methods

Construct NurbsSurfaceData based on NURBS surface data, where the weights are supplied.
 The NURBS surface will be (piecewise) polynomial if all the weights are equal, rational if not.
 Note: A rational polynomial is a quotient of two polynomials; this includes a polynomial,
 which can be thought of as a quotient with denominator equal to 1.